Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: The |layout| command allows basic page setup in the atlas mode.
ru_ru: Команда |layout| позволяет произвести базовую настройку страницы в режиме атласа.

source: Then also continuation description is displayed in the map.
ru_ru: Таким образом отображается описание продолжения на карте.

source: Then the declination of each shot will be set according to the date specification of the data object.
ru_ru: Тогда склонение каждого замера будет установлено в соответствии со спецификацией даты объекта данных.

source: Then you have to enter real coordinates of these points (X1, Y1, X2, Y2).
ru_ru: Затем вам нужно ввести реальные координаты этих точек (X1, Y1, X2, Y2).

source: Then { m123} looks like this:
ru_ru: Тогда { m123} выглядит так:

source: There are a few rules about how such a file should look:
ru_ru: Существует\break несколько правил о том, как должен выглядеть такой файл:

source: There are also hyperlinks at the border of the map if the cave continues on the next page and on the appropriate cells of the Navigator.
ru_ru: Отображаются также гиперссылки на границе карты, если пещера продолжается на следующей странице и в соответствующих ячейках навигатора.

source: There are also some predefined macros which help with the processing of |*| variables:
ru_ru: Существуют также некоторые предопределенные макросы, которые\break помогают с обработкой |*| переменных:

source: There are currently two special symbols: scale bar and north arrow.
ru_ru: В настоящее время существуют два специальных символа: шкала масштаба и стрелка на север.

source: There are four predefined pens { PenA} (thickest) { PenD} (thinnest), which should be used for all drawings.
ru_ru: Существует четыре предопределенных ручки { PenA} (самый толстый) { PenD} (самый тонкий), которые должны использоваться для всех чертежей.

source: There are many possible arrangements for a page.
ru_ru: Существует много возможных вариантов для страницы.

source: There are two simple tests that scrap outline is correct:
ru_ru: Есть два простых теста, которые определяют правильность скрапа:

source: There are two special symbols: north-arrow, scale-bar.
ru_ru: Есть два специальных символа: north-arrow (стрелка на север), scale-bar (шкала масштаба).

source: There is a general-purpose macro for typesetting in multiple columnsNot to be used with map legend, where multiple columns are to be adjusted by |legend-columns| layout option]:
ru_ru: Есть макрос общего назначения для набора текста в нескольких столбцахНе используйте с легендой карты оформленной в несколько столбцов с помощью опции |legend-columns| макета.]:

source: There is a macro || which combines most of the token registers mentioned above to get simple preformatted atlas introductory pages.
ru_ru: Макрос || объединяет большинство перечисленных токенов,\break чтобы получить простой, предварительно отформатированный, вывод\break страницы в виде атласа.

source: There is a map |main_map| which contains scraps |s1| and |s2|.
ru_ru: Есть карта |main_map| которая содержит скрапы |s1| и |s2|.

source: There is a menu { Data table} for typing the data.
ru_ru: Для ввода данных существует меню { Таблица данных}.

source: There is a { Search and select} menu which makes it easy to switch between objects and visualize things you can't see at the first look at the picture.
ru_ru: Существует меню { Поиск и выделение}, которое позволяет легко\break переключаться между объектами и показывать элементы, которые вы не видите при взгляде на изображение.

source: There is also a || macro which takes a box as an argument and displays the box framed.
ru_ru: Также есть макрос ||, который принимает бокс в качестве аргумента и отображает бокс в рамке.

source: There is only a map on the page.
ru_ru: На странице есть только карта.

source: There was , a high level programming language for vector graphics description, Survex for excellent processing of survey shots, and for typesetting the results.
ru_ru: Это был -- язык программирования высокого уровня для описания векторной графики, Survex -- отличная\break программа для обработки нитки хода, и -- для верстки результатов.

source: Therefore it's necessary to set { T} variable to |identity| before drawing.
ru_ru: Поэтому\break необходимо установить переменную { T} в |identity| перед рисованием.

source: Therion also exports 3D model (full or centreline) in various formats.
ru_ru: Therion также экспортирует трехмерную модель (полную или нитку хода) в различных форматах.

source: Therion automatically generates list of used map symbols and lists of persons who have discovered, surveyed and drawn selected part of the cave.
ru_ru: Therion автоматически генерирует список используемых символов карты и списки лиц, которые обнаружили, исследовали и нарисовали выбранную часть пещеры.

source: Therion can then do its task much better than if it was a standalone application in which you could calibrate your printer or scanner and with one click send e-mail with your data.
ru_ru: Therion в связке с другими\break программами может выполнить свою задачу намного лучше.

source: Therion contains built-in IGRFSee {https://www.ngdc.noaa.gov/IAGA/vmod/}] Earth geomagnetic field model valid for period 1900--2020{5.4}.
ru_ru: Therion содержит встроенный IGRFСмотрите {https://www.ngdc.noaa.gov/IAGA/vmod/}] -- модель геомагнитного поля Земли, действительная для периода 1900--2020 гг{5.4}.

source: Therion does not automatically generate these lines because their shape usually depends on particilar map.
ru_ru: Therion автоматически не генерирует эти линии, потому что их форма обычно зависит от конкретной карты.

source: Therion does the transformation from this local coordinate system to the real coordinates using the positions of survey stations, which are specified both in the scrap as point map symbols and in centreline data.
ru_ru: Therion делает преобразование этой локальной системы координат в реальные\break координаты, используя позиции станций съемки, которые определены в\break скрапе как символы точки на карте и определены в нитке хода.

source: Therion exports data for 2D maps in format.
ru_ru: Therion экспортирует данные для 2D-карт в формате .

source: Therion in depth.
ru_ru: В глубь Therion'а.

source: Therion is a command-line application.
ru_ru: Therion -- приложение для командной строки.

source: Therion is a tool for cave surveying.
ru_ru: Therion это программа для создания карт пещер.

source: Therion is copyrighted software.
ru_ru: Therion -- программное обеспечение, защищенное авторскими правами.\break

source: Therion is distributed under the [GNU General Public License] {https://www.gnu.org/}.
ru_ru: Therion распространяется под лицензией [GNU General Public License] {https://www.gnu.org/}.

source: Therion itself does the main task.
ru_ru: Сам Therion выполняет главную задачу.

source: Therion may export 3D model in various formats besides its native format.
ru_ru: Therion может экспортировать 3D-модель в различные форматы, помимо собственного формата.

source: Therion needs:
ru_ru: Therion'у необходимо:

source: Therion provides some basic facts about each survey (length, vertical range, N--S range, E--W range, number of shots and stations) if |-x| option is given.
ru_ru: Если опция |-x| включена, то Therion выводит некоторые основные данные о каждой съемки (длина, амплитуда, длина с севера на юг, длина с запада на восток, количество замеров и станций).

source: Therion reads following environment variables:
ru_ru: Therion считывает следующие переменные среды:

source: Therion reads settings from the initialization file.
ru_ru: Therion считывает настройки из файла инициализации.

source: Therion requires LCDF Typetools to be installed on your system to use this command.
ru_ru: Для использования этой команды Therion требует установки LCDF\break Typetools в вашей системе.

source: Therion supports compilation of Win32 executables in Linux using MXE cross compiler ({http://mxe.cc}).
ru_ru: Therion поддерживает компиляцию исполняемых файлов Win32 в Linux с использованием кросс-компилятора MXE ({http://mxe.cc}).

source: Therion supports coordinate transformations in geodetic coordinate systems.
ru_ru: Therion поддерживает преобразования координат в геодезические системы координат.

source: Therion supports translation of map labels.
ru_ru: Therion поддерживает перевод текстовых меток на картах.

source: Therion surveys nearly correspond to station prefixes defined by |*begin|/|*end| pairs in survex source files.
ru_ru: Съемки Therion'а почти соответствуют префиксам станций, определяемым парой |*begin|/|*end| в файлах survex.

source: Therion uses and for 2D map visualization and typesetting.
ru_ru: Therion использует и для 2D-визуализации карт и верстки.

source: Therion uses following data types:
ru_ru: Therion использует следующие типы данных:

source: Therion uses following predefined symbol sets: UIS (International Union of Speleology) ASF (Australian Speleological Federation) AUT (Austrian Speleological Association) CCNP (Carlsbad Caverns National Park){5.4} NZSS (New Zealand Symbol Set){5.4} SKBB (Speleoklub Banska Bystrica)
ru_ru: Therion использует следующие предопределенные наборы символов: UIS (Международный союз спелеологии) ASF (Австралийская спелеологическая федерация) AUT (Австрийская спелеологическая ассоциация) CCNP (Национальный парк Карлсбадских пещер){5.4} NZSS (набор символов Новой Зеландии){5.4} SKBB (спелеоклуб Bansk{\my a} Bystrica).

source: Therion uses most advanced PDF features like transparency and layers.
ru_ru: Therion использует самые продвинутые функции PDF, такие как прозрачность и слои.

source: Therion uses pdfwith the { plain} format for typesetting.
ru_ru: Therion использует pdf с форматом { plain} для типографского набора.\break

source: Therion uses the same encoding files as |afm2tfm| program from the distribution, which has the same format as an encoding vector in a PostScript font.
ru_ru: Therion использует те же файлы кодировки, что и программа |afm2tfm| из дистрибутива , который имеет тот же формат, что и векторная кодировка в шрифте PostScript.

source: Therion's and XTherion's system dependent settings are specified in the file therion.ini or xtherion.ini, respectively.
ru_ru: Системно-зависимые параметры Therion'а и XTherion'а указаны в файле\break therion.ini или xtherion.ini, соответственно.

source: Therion's layout command makes it easy to switch among various predefined map symbol sets.
ru_ru: Команда layout Therion'а позволяет легко переключаться между\break различными предопределенными наборами символов карты.

source: Therion's { makefile} may take some optional parameters.
ru_ru: Файл Therion'а { makefile} может принимать некоторые необязательные опции:

source: These are by default all the following:
ru_ru: По умолчанию это все следующие объекты:

source: These are excluded from length calculations.
ru_ru: Они\break исключаются из расчетов длины.

source: These are read back and converted to a PDF-like format, which forms input data for pdf.
ru_ru: Они считываются и преобразуются в PDF формат, который\break формирует входные данные для pdf.

source: These lines may contain either data or options, which are applied to subsequent data.
ru_ru: Эти строки могут содержать либо данные, либо параметры, которые\break применяются к последующим данным.

source: These lines shouldn't intersect---otherwise Therion () can't determine the interior of the scrap and issues a warning message ``|scrap outline intersects itself|''.
ru_ru: Эти линии не должны\break пересекаться, иначе, Therion () не может определить внутреннюю часть скрапа и выдает предупреждение ''|scrap outline intersects itself|''.

source: These maps do not contain visualized map symbols
ru_ru: Эти карты не содержат визуализированных символов карты.

source: These may be loaded in appropriate viewing, editing or raytracing programs to be printed or further processed.
ru_ru: Они могут быть загружены в соответствующие\break программы просмотра, редактирования или трассировки для печати или дальнейшей обработки.

source: These problems remained when we tried to draw maps using some CAD programs in 1998 and 1999.
ru_ru: Эти проблемы оставались, когда мы пытались рисовать карты с помощью некоторых программ CAD в 1998 и 1999 годах.

source: These take automatically care of { T} transformation.
ru_ru: Они автоматически обрабатывают\break трансформацию { T}.

source: These were a great help, especially for large and complicated cave systems.
ru_ru: Это было большим подспорьем в работе, особенно работая над крупными и сложными пещерными системами.

source: They are automatically inserted in the { Area control} and named (if not already named).
ru_ru: Они автоматически вставляются в { Область} и называются (если они еще не\break названы).

source: They are searched for in the following directories:
ru_ru: Они ищутся в следующих\break каталогах:

source: They contain instructions for Therion like
ru_ru: Файлы содержат инструкции для Therion'а, такие как:

source: They determine our playground when defining page layout using the || macro.
ru_ru: Они устанавливают нашу площадку при определении макета страницы используя макрос ||.

source: They may be of any type, but must be listed in order and each pair of consecutive lines must intersect.
ru_ru: Они\break могут быть любого типа, но должны быть перечислены друг за другом, и каждая пара последовательных линий должны пересекаться.

source: Thinking in Therion.
ru_ru: Несколько мыслей о Therion'е.

source: This allows stations to be numbered from 0 in each survey or the joining of two caves into one cave system without renaming survey stations.
ru_ru: Это позволяет делать нумерацию станций с 0 в каждом survey или объединение двух пещер в одну пещерную систему без переименования станций съемки.

source: This allows the use of non-ASCII characters in input files.
ru_ru: Это позволяет использовать\breakсимволы не ASCII во входных файлах.

source: This allows user to configure various things (like user defined symbols, map and atlas layout at one place &c.) See the chapter {it Changing layout} for details.
ru_ru: Это позволяет пользователю настраивать различные элементы (например, пользовательские символы, макет карты и атласа в одном месте и т.д.). Для подробностей смотрите главу {it Изменение макета}.

source: This approach has the advantage that the user has direct access to the advanced typesetting engine without making the language of Therion overcomplex.
ru_ru: Преимущество такого подхода состоит в том, что пользователь имеет прямой доступ к расширенному механизму набора текста, не делая язык Therion сверхсложным.

source: This book describes Therion version .
ru_ru: В этой книге описывается Therion version .

source: This can be done by specifying
ru_ru: Это можно сделать, указав

source: This can be extracted by XTherion to produce georeferenced raster images (see { XTherion/Additional tools} for details).
ru_ru: Эти данные можно получить с помощью XTherion'а для создания растровых изображений с привязками (подробнее смотрите { XTherion/Дополнительные инструменты}).

source: This changes the { Action button} to { Insert scrap} if it had any other value.
ru_ru: Это изменит кнопку { Действие} на { Вставить скрап}, если у нее было другое значение.

source: This chapter explains how |-clip|, |-place|, |-visibility| and |-context| options of |point|, |line| and |area| commands exactly work.
ru_ru: В этой главе объясняется работа опций |-clip|, |-place|, |-visibility| и |-context| команд |point|, |line| и |area|.

source: This chapter is automatically generated from the samples directory in the Therion source code.
ru_ru: Эта глава автоматически создается из каталога примеров в исходном коде Therion'а.

source: This chapter is extremely useful if you're not satisfied with the predefined layout of map symbols and maps provided, and want to adapt them to your needs.
ru_ru: Эта глава чрезвычайно полезна, если вас не устраивает предопределенный макет символов карты и ее предоставление, и вы хотите адаптировать их к вашим желаниям.

source: This command is used to set or change properties of an already existing object.
ru_ru: Эта команда используется для установки или изменения свойств уже\break существующего объекта.

source: This command is used to store predefined precisions of centreline data.
ru_ru: Эта команда используется для сохранения предопределенных точных\break данных нитки хода.

source: This command |line| has one obligatory argument, a line type (passage wall in this case), followed by one option.
ru_ru: Эта команда |line| имеет один обязательный аргумент, тип линии (коренная стена в данном случае), за которой следует одна опция.

source: This consisted only of about 32 kB of Perl scripts and macros but served the purpose of showing that our ideas were implementable.
ru_ru: Она состояла примерно из 32 КБ Perl скриптов и макросов, но программа показала, что наши идеи были осуществимы.

source: This corresponds with a section of hand-drawn map, which is built up from points, lines and filled areas.
ru_ru: Это соответствует этапу ручного рисования карты,\break которая строится из точек, линий и заполненных областей.

source: This creates a file |texts_xx.txt|.
ru_ru: Это создаст файл |texts_xx.txt|.

source: This defines the position of each element on the page.
ru_ru: Это определяет положение каждого элемента на странице.

source: This encoding doesn't need to be specified in the pdf's map file.
ru_ru: Эта кодировка не нуждается в указывании в файле карты pdf.

source: This file is UTF-8 encoded.
ru_ru: Этот файл имеет кодировку UTF-8;

source: This file may be loaded into any SQL database (after some database-dependent initialization, which may include running a SQL server and connecting to it, creating a database and connecting to it.
ru_ru: Этот файл может быть загружен в любую базу данных SQL (после некоторой инициализации, зависящей от базы данных, которая может включать запуск SQL-сервера и подключение к нему, создание базы данных и подключение к ней.

source: This form allows you to apply both scaling and rotation to the scrap.
ru_ru: Эта форма позволяет применять как масштабирование, так и поворот скрапа.

source: This has the same effect as if the map printed in |base-scale| would be photo-reduced to the |scale|.
ru_ru: Это имеет такой же эффект, как если бы карта, распечатанная в\break |base-scale|, была бы масштабирована к |scale|.

source: This helps a lot with large cave systems: if some scrap is referenced, you immediately know in which file it had been defined.
ru_ru: Это очень помогает с большими пещерными системами; если упоминается какой-то скрап, вы сразу же знаете в каком файле он был определен.

source: This image after morphing:
ru_ru: Это изображение после морфинга:

source: This information is displayed in XTherion, { Compiler} window, { Survey info} menu, when some survey from the { Survey structure} menu is selected.
ru_ru: Эта информация отображается в окне XTherion'а { Компилятор}, в меню { Информация}, когда выбрана какая-либо съемка в меню { Структура съемки}.

source: This information is used for |cave-list| export.
ru_ru: Эта информация используется для |cave-list| экспорта.

source: This is because in top level import command, survey { create} is imported from file |create/create.3d| with wrong coordinates, and we import top-level .3d file with |-surveys use| switch.
ru_ru: Это происходит потому, что в команде импорта верхнего уровня съемка\break { create} импортируется из файла |create/create.3d| с неправильными\break координатами, и мы импортируем файл .3d верхнего уровня с |-surveys use|.

source: This is done through its options such as |page-setup| or |overlap|.
ru_ru: Это делается с помощью таких опций, как |page-setup| или |overlap|.

source: This is not done automatically because you may wish to insert some other pages before the first map page.
ru_ru: Это не делается автоматически, потому что вы можете вставить некоторые другие страницы перед первой страницей карты.

source: This is obviously not what we would like to get.
ru_ru: Очевидно это не то, что мы хотели бы получить.

source: This is useful because the zero value (no neighbouring page) shouldn't be displayed.
ru_ru: Это полезно, потому что нулевое\break значение (нет соседней страницы) не должно отображаться.

source: This is usually done in two steps (assume that four arguments are { P}, { R}, { S}, { A}):
ru_ru: Обычно это делается в два этапа (предположим, есть четыре аргумента: { P}, { R}, { S}, { A}):

source: This line is hidden by XTherion and may be accessed only indirectly using the right-hand menu.]
ru_ru: Эта строка скрыта XTherion'ом и может быть доступна только косвенно, используя правое меню.].

source: This makes it easy to add new symbols at the run-time.
ru_ru: Это упрощает добавление новых символов во время выполнения.

source: This makes it possible to change map symbols used without changing the input data, or merge more maps created by different persons in different styles into one map with unified map symbols set.
ru_ru: Это позволяет изменять символы карты, используемые без изменения\break входных данных, или объединить большие карты, созданные разными людьми в разных стилях, в одну карту с едиными символами.

source: This manual does not describe such familiar things as `if you want to save a file, go to menu File and select Save, or press Ctrl-s'.
ru_ru: В этом руководстве не описываются такие знакомые вещи, как `если вы хотите сохранить файл, перейдите в меню Файл и выберите Сохранить или нажмите Ctrl-s'.

source: This means, cave.create.1 will be imported here as create.1@cave and not 1@create.cave.
ru_ru: Это значит, что cave.create.1 будет импортироваться здесь как create.1@cave, а не 1@create.cave.

source: This means, that object identifiers must be unique only in the scope of one survey.
ru_ru: Это означает, что идентификаторы объектов должны быть уникальными только в рамках одного survey.

source: This means, that shot from 1 to 5 will be ignored, when extended elevation is generated.
ru_ru: Это означает, что замер со станции 1 на станцию 5 будет проигнорирован, когда генерируется разрез-развертка.

source: This option creates an altitude label on the wall.
ru_ru: Этот параметр создает метку высоты на стене.

source: This option is not allowed in the |plan| projection.
ru_ru: Этот параметр не используется в проекции |plan|.

source: This option overrides |symbol-set| option.}
ru_ru: Эта опция переопределяет опцию |symbol-set|.}

source: This sample shows three different ways, how to deal with station prefixes when importing survex .3d files to therion.
ru_ru: В этом примере\break показаны три разных способа, как иметь дело с префиксами станций при импорте файлов survex .3d в Therion.

source: This setting is used by default for Czech/Slovak and cyrillic fonts to avoid errors on systems without these fonts present.
ru_ru: Этот параметр используется по умолчанию для чешских/словацких и\break кириллических шрифтов, чтобы избежать ошибок для систем без этих шрифтов.

source: This symbol has no visual representation.
ru_ru: Этот символ не имеет визуального представления.

source: This value is afterwards displayed in survey/cave statistics.
ru_ru: Это значение будет отображаться в статистике съемки/пещеры.

source: This version already included some interesting features such as { transformation functions} which allowed user specification of the input format for survey data, or splitting large maps to multiple sheets.
ru_ru: Эта версия уже включала некоторые интересные функции, такие как { функции трансформации}, которые позволяли определять спецификацию входного формата для данных съемки или разбивать большие карты на несколько листов.
